---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateInteger(System.Int32)
source: html/54556861-6964-a97b-7045-1404a51c182b.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateInteger Method

Creates an integer data object.

## Syntax (C#)
```csharp
public static IFCData CreateInteger(
	int value
)
```

## Parameters
- **value** (`System.Int32`) - The integer value.

## Returns
The IFCData object.